Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetSpecularColor(Autodesk.Revit.DB.Color)
Sets the specular color parameter of the effect instance.
color:
The specular color value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetEmissiveColor(Autodesk.Revit.DB.Color)
Sets the emissive color parameter of the effect instance.
color:
The emissive color value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetDiffuseColor(Autodesk.Revit.DB.Color)
Sets the diffuse color parameter of the effect instance.
color:
The diffuse color value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetAmbientColor(Autodesk.Revit.DB.Color)
Sets the ambient color parameter of the effect instance.
color:
The ambient color value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetColor(Autodesk.Revit.DB.Color)
Sets the color parameter of the effect instance.
color:
The color value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectContext3D.EffectInstance.MatchesFormat(Autodesk.Revit.DB.DirectContext3D.VertexFormat)
Tests whether the effect instance is appropriate for the given vertex format.
Remarks:
The vertex format may define vertex data that are not used by the effect instance. However, the effect
instance can not reference vertex data that do not exist in the vertex format.
vertexFormat:
A vertex format.
Returns:
True if the effect instance is valid for use with the specified vertex format.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017